---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderPersistentIds.IsAssociatedBRepBuilderValid
source: html/817496ab-6542-91cf-247d-6455add3df09.htm
---
# Autodesk.Revit.DB.BRepBuilderPersistentIds.IsAssociatedBRepBuilderValid Method

Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.

## Syntax (C#)
```csharp
public bool IsAssociatedBRepBuilderValid()
```

## Returns
True if the associated BRepBuilder exists, false otherwise.